app/controllers/movies_controller.rb

  def by_director
    director = params[:director]
    @movie = Movie.find(director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]